input.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.vodafone.com/rig/internal/validateheader/v1.0" xmlns:head="http://xmlns.vodafone.co.uk/map/til/wsdl/Common/Header" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header><head:Header><head:source xmlns:cre="http://xmlns.vodafone.co.uk/map/til/ProvisioningAndFulfilment/OrderFulfilmentCoordination/CommercialOrderExecutionManagement/CreateSalesOrder" xmlns:log="http://xmlns.vodafone.co.uk/map/til/Common/CommonObjects/Logon" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2" xmlns:v21="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/SalesOrder/V2" xmlns:v22="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/Common/V2" xmlns:v23="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/EBO/SalesOrder/V2">Apple</head:source><head:sourceTimestamp xmlns:cre="http://xmlns.vodafone.co.uk/map/til/ProvisioningAndFulfilment/OrderFulfilmentCoordination/CommercialOrderExecutionManagement/CreateSalesOrder" xmlns:log="http://xmlns.vodafone.co.uk/map/til/Common/CommonObjects/Logon" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2" xmlns:v21="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/SalesOrder/V2" xmlns:v22="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/Common/V2" xmlns:v23="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/EBO/SalesOrder/V2">2012-05-16T13:19:40.911+01:00</head:sourceTimestamp><head:transactionId xmlns:cre="http://xmlns.vodafone.co.uk/map/til/ProvisioningAndFulfilment/OrderFulfilmentCoordination/CommercialOrderExecutionManagement/CreateSalesOrder" xmlns:log="http://xmlns.vodafone.co.uk/map/til/Common/CommonObjects/Logon" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2" xmlns:v21="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/SalesOrder/V2" xmlns:v22="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/Common/V2" xmlns:v23="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/EBO/SalesOrder/V2">Tes000000000999</head:transactionId><head:originator>APPLE</head:originator></head:Header><ns1:Security xmlns:cre="http://xmlns.vodafone.co.uk/map/til/ProvisioningAndFulfilment/OrderFulfilmentCoordination/CommercialOrderExecutionManagement/CreateSalesOrder" xmlns:log="http://xmlns.vodafone.co.uk/map/til/Common/CommonObjects/Logon" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2" xmlns:v21="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/SalesOrder/V2" xmlns:v22="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/Common/V2" xmlns:v23="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/EBO/SalesOrder/V2" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
</ns1:Security></SOAP-ENV:Header><SOAP-ENV:Body><cso:CreateSalesOrderRequest xmlns:cre="http://xmlns.vodafone.co.uk/map/til/ProvisioningAndFulfilment/OrderFulfilmentCoordination/CommercialOrderExecutionManagement/CreateSalesOrder" xmlns:log="http://xmlns.vodafone.co.uk/map/til/Common/CommonObjects/Logon" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2" xmlns:v21="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/SalesOrder/V2" xmlns:v22="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/Common/V2" xmlns:v23="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/EBO/SalesOrder/V2" xmlns:cso="http://xmlns.vodafone.co.uk/map/til/ProvisioningAndFulfilment/OrderFulfilmentCoordination/CommercialOrderExecutionManagement/CreateSalesOrder" xmlns:com="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2" xmlns:so="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/SalesOrder/V2">
			<cso:SalesOrder actionCode="ADD">
				<com:SalespersonPartyReference>
					<com:LocationReference>
						<com:LocationIdentification>
							<com:ApplicationObjectKey>
								<com:ID>10002239</com:ID>
							</com:ApplicationObjectKey>
						</com:LocationIdentification>
					</com:LocationReference>
				</com:SalespersonPartyReference>
				<so:SalesOrderLine>
					<com:Identification>
						<com:ApplicationObjectKey>
							<com:ID>1</com:ID>
						</com:ApplicationObjectKey>
					</com:Identification>
					<so:ServiceActionCode>NewPromotion</so:ServiceActionCode>
					<com:ItemReference>
						<com:ItemIdentification>
							<com:ApplicationObjectKey>
								<com:ID>107789</com:ID>
							</com:ApplicationObjectKey>
						</com:ItemIdentification>
					</com:ItemReference>
				</so:SalesOrderLine>
				<so:SalesOrderLine>
					<com:Identification>
						<com:ApplicationObjectKey>
							<com:ID>2</com:ID>
						</com:ApplicationObjectKey>
					</com:Identification>
					<so:ServiceActionCode>New</so:ServiceActionCode>
					<com:ItemReference>
						<com:ItemIdentification>
							<com:ApplicationObjectKey>
								<com:ID>100000</com:ID>
							</com:ApplicationObjectKey>
						</com:ItemIdentification>
					</com:ItemReference>
					<com:PromotionReference>
						<com:PromotionIdentification>
							<com:ApplicationObjectKey>
								<com:ID>1</com:ID>
							</com:ApplicationObjectKey>
						</com:PromotionIdentification>
					</com:PromotionReference>
					<so:SalesOrderSchedule>
						<so:SalesOrderItemInstance>
							<com:Identification>
								<com:ID>447341766956</com:ID>
							</com:Identification>
						</so:SalesOrderItemInstance>
					</so:SalesOrderSchedule>
				</so:SalesOrderLine>
				<so:SalesOrderLine>
					<com:Identification>
						<com:ApplicationObjectKey>
							<com:ID>3</com:ID>
						</com:ApplicationObjectKey>
					</com:Identification>
					<so:ServiceActionCode>New</so:ServiceActionCode>
					<com:ParentSalesOrderLineIdentification>
						<com:ApplicationObjectKey>
							<com:ID>2</com:ID>
						</com:ApplicationObjectKey>
						<com:AlternateObjectKey>
							<com:ID>2</com:ID>
						</com:AlternateObjectKey>
					</com:ParentSalesOrderLineIdentification>
					<com:ItemReference>
						<com:ItemIdentification>
							<com:ApplicationObjectKey>
								<com:ID>079917</com:ID>
							</com:ApplicationObjectKey>
						</com:ItemIdentification>
					</com:ItemReference>
					<com:PromotionReference>
						<com:PromotionIdentification>
							<com:ApplicationObjectKey>
								<com:ID>1</com:ID>
							</com:ApplicationObjectKey>
						</com:PromotionIdentification>
					</com:PromotionReference>
					<so:SalesOrderSchedule>
						<so:SalesOrderItemInstance>
							<com:Identification>
								<com:ID>89441000300495518783</com:ID>
							</com:Identification>
						</so:SalesOrderItemInstance>
					</so:SalesOrderSchedule>
				</so:SalesOrderLine>
				<so:SalesOrderCustomerParty>
					<com:CustomerPartyReference>
						<com:CustomerPartyAccountIdentification>
							<com:ApplicationObjectKey>
								<com:ID>7000218730</com:ID>
							</com:ApplicationObjectKey>
						</com:CustomerPartyAccountIdentification>
					</com:CustomerPartyReference>
				</so:SalesOrderCustomerParty>
				<so:SalesOrderBillToParty>
					<com:BillToPartyReference>
						<com:BillingProfileReference>
							<com:BillingProfileIdentification>
								<com:ApplicationObjectKey>
									<com:ID>1-2X0OH0C</com:ID>
								</com:ApplicationObjectKey>
							</com:BillingProfileIdentification>
						</com:BillingProfileReference>
					</com:BillToPartyReference>
				</so:SalesOrderBillToParty>
			</cso:SalesOrder>
		</cso:CreateSalesOrderRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
